const data = `GrandePizzeria, [02.09.21 13:54]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Бізнес ланч                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 95.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 0682170398
 ВСЬОГО: 102.95

GrandePizzeria, [02.09.21 16:20]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Віладжіо                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 135.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 0671242671
 ВСЬОГО: 142.95

GrandePizzeria, [02.09.21 19:47]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Картопля запечена                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 35.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Картопля фрі                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 40.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Качаторі                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 119.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Куатро Карне                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 116.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 380935248460
 ВСЬОГО: 341.80

GrandePizzeria, [03.09.21 11:25]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Grande Куатро Формаджі                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 369.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 0997398891
 ВСЬОГО: 376.95

GrandePizzeria, [03.09.21 15:46]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Моданостра                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 135.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Куатро Карне                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 116.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 0997042429
 ВСЬОГО: 266.90

GrandePizzeria, [03.09.21 17:13]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Салямі                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 104.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Grande Салямі                         
 КІЛЬКІСТЬ ТОВАРУ: 3                         
 ЦІНА ТОВАРУ: 269.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 0954011955
 ВСЬОГО: 942.80

GrandePizzeria, [03.09.21 17:36]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Цезар                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 128.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Моданостра                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 135.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Неополітана з сирними бортиками                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 116.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН: 0938534646
 ВСЬОГО: 402.85

GrandePizzeria, [03.09.21 17:37]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Маргарита                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 96.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Куатро Формаджі Бьянко                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 142.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Кардинале                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 109.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН:  380508108672
 ВСЬОГО: 370.85

GrandePizzeria, [03.09.21 19:07]
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: З білими грибами                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 120.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
==============ТОВАР==============
                         
 НАЗВА ТОВАРУ: Куатро Формаджі Бьянко                         
 КІЛЬКІСТЬ ТОВАРУ: 1                         
 ЦІНА ТОВАРУ: 142.95                         
 ЦІНА УПАКОВКИ: 7
                         
==============ТОВАР==============
 ТЕЛЕФОН:  380666696134
 ВСЬОГО: 277.90`




// ? FUNCTIONS

const calcGlobalSum = arrayOfStrings => {
    let sum = 0
    for (const string of arrayOfStrings) 
        if (string.split(' ')[1] === 'ВСЬОГО:') 
            sum += +string.split(' ')[2]

    return sum.toFixed(2)
}

const stringToArray = str => str.split(`\n`)

const getNameOfDish = arrayOfStrings => {
    const localArrayOfDishes = []
    for (const string of arrayOfStrings) {
        // console.log(string.split(' ')[1]);
        let dish = {}
        if (string.split(' ')[1] === 'НАЗВА') {
            dish['name'] = string.split('НАЗВА ТОВАРУ: ')[1]
        }
        if (string.split(' ')[1] === 'КІЛЬКІСТЬ') {
            dish['quantity'] = string.split('КІЛЬКІСТЬ ТОВАРУ: ')[1]
        }
        if (dish.name !== null && dish.quantity  !== null) localArrayOfDishes.push(dish)
    }
    return localArrayOfDishes
}



//!  FUNCTIONS START

const arrayOfStrings = stringToArray(data)

const globalSum = calcGlobalSum(arrayOfStrings)

const arrayOfDishes = getNameOfDish(arrayOfStrings)

// * * CONSOLE OUTPUT

console.log(`Загальний прибуток ${globalSum} грн`)

console.log(arrayOfDishes)


